TDPortal/Utilities/EnhancedExposedServicesTestTool/ExposedServicesTestToolClient/Requests/OpenJourneyPlanner/V1/CoordinateJourney_2.xml

<?xml version="1.0"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <PlanJourney xmlns="http://www.transportdirect.info/TransportDirect.EnhancedExposedServices.OpenJourneyPlanner.V1">
      <transactionId>testOpenJP</transactionId>
      <language>en-gb</language>
      <request>
        <ModeFilter>
          <Include>true</Include>
          <Modes>
            <TransportMode>
              <Mode>Walk</Mode>
            </TransportMode>
            <TransportMode>
              <Mode>Bus</Mode>
            </TransportMode>
            <TransportMode>
              <Mode>Metro</Mode>
            </TransportMode>
            <TransportMode>
              <Mode>Coach</Mode>
            </TransportMode>
            <TransportMode>
              <Mode>Air</Mode>
            </TransportMode>
          </Modes>
        </ModeFilter>
        <Depart>true</Depart>
        <Destination>
          <Coordinate>
            <Easting>363905</Easting>
            <Northing>159865</Northing>
          </Coordinate>
		  <GivenName>DESTINATION NAME</GivenName>
          <Stops>
            <RequestStop>
              <TimeDate>2014-04-27T11:44:23.488+01:00</TimeDate>
            </RequestStop>
          </Stops>
          <Type>Coordinate</Type>
        </Destination>
        <Origin>
          <Coordinate>
            <Easting>365491</Easting>
            <Northing>158651</Northing>
          </Coordinate>
		  <GivenName>ORIGIN NAME</GivenName>
		  <Locality>E0034964</Locality>
          <Stops>
            <RequestStop>
              <TimeDate>2014-04-27T11:44:23.488+01:00</TimeDate>
            </RequestStop>
          </Stops>
          <Type>Coordinate</Type>
        </Origin>
        <PublicParameters>
          <Algorithm>Default</Algorithm>
          <InterchangeSpeed>10</InterchangeSpeed>
          <IntermediateStops>All</IntermediateStops>
          <MaxWalkDistance>30</MaxWalkDistance>
          <RangeType>Sequence</RangeType>
          <TrunkPlan>false</TrunkPlan>
          <WalkSpeed>20</WalkSpeed>
        </PublicParameters>
      </request>
    </PlanJourney>
  </soap:Body>
</soap:Envelope>
